Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/000.Preface_and_New_Features/000.000.Notes.org
#+title: Chapter 0: Preface & New Features
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%}</style>

* Navigation
| Nav   | Title                                                            | Links                                   |
|-------+------------------------------------------------------------------+-----------------------------------------|
| Index | Notes Home                                                       | \vert [[file:../../index.html][html]] \vert [[file:../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | User's Guide for Oracle Business Intelligence Enterprise Edition | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition][github]] \vert |
| Prev  |                                                                  |                                         |
| Next  | Chapter 1: Introducing Oracle Business Intelligence              | \vert [[file:../001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.html][html]] \vert [[file:./001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition][github]] \vert |

* Notes

** Section 1.1: Preface
   - The Oracle Business Intelligence Foundation Suite is a complete, open, and integrated solution for all enterprise business intelligence needs including reporting, ad-hoc queries, OLAP (Online Analytical Processing), dashbords, scorecards, and what-if analysis
   - Oracle Business Intelligence Foundation Suite includes Oracle Business Intelligence Enterprise Edition
   - Oracle Business Intelligence Enterprise Edition (OBIEE) is a comprehensive set of enterprise business intelligence tools and infrastructure, including a scalable and efficient query and analysis server, an ad-hoc query and analysis tool, interactive dashboards, proactive intelligence and alerts, and an enterprise reporting engine
   - [[https://docs.oracle.com/middleware/bi12214/bisuite/index.html][Oracle Docs Home for Oracle Business Intelligence Suite 12.2.1.4.0]]

** Section 1.2: New Features for Oracle Business Intelligence Users
   - Enhacements to graphs
   - Enhacements to views
   - Enhacement to analyses
   - Enhacement to scorecards
   - Enhacement to dashboards
   - New home page
   
* Keywords
| Term           | Definition                                                                                                                                 |
|----------------+--------------------------------------------------------------------------------------------------------------------------------------------|
| OBIEE          | Oracle Business Intelligence Enterprise Edition (a complete, open, and integrated solution for all enterprise business intelligence needs) |
| Ad-hoc Queries |                                                                                                                                            |
| OLAP           |                                                                                                                                            |

* Questions
  - *Q*: What are ad hoc queries?
         - [[https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query][StackOverFlow Answer]]
	 - [[https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query][ThoughtSpot Ad-hoc Article]]
	 - Ad-hoc queries are queries that are created for specific purposes to gather information that is needed right now thus the query is loosely created or created on the fly because we need some information right now from the data
	 - How is this important for OBIEE? Well if a Oracle customer has a bunch of data, let's say data about their customers, then they can create ad-hoc queries to find out: what is the common age group? where do they live? what do they buy?
	 - Questions can be quickly answered from the data, basically filtering and answering questions by these ad-hoc queries
	 - Plus these ad-hoc queries are questions that need to be answered now thus these queries might not be run again later or may change in the answer if it is run later
	 - These seems like regular queries to me, so why the name? The difference is ad-hoc queries are used "on the fly" by data analysts that are exploring answers and researching and filtering the data. These queries tend to be short and quickly created. Compare this to stored procedures, these queries are typically longer and follow some chronological order but this is because we are not trying to answer a new question now but rather see if the answer of a previous question has changed
	 - Thus stored procedures are different than ad-hoc queries because stored procedures are running the same query throughout different times
	   
  - *Q*: What is OLAP (Online Analytical Processing)?

* Summary
