Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/000.Preface_and_New_Features/000.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-06 Mon 20:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 0: Preface &amp; New Features</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 0: Preface &amp; New Features</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9e4de33">Navigation</a></li>
<li><a href="#org802ff95">Notes</a>
<ul>
<li><a href="#orga59f1cf">Section 1.1: Preface</a></li>
<li><a href="#org75f3181">Section 1.2: New Features for Oracle Business Intelligence Users</a></li>
</ul>
</li>
<li><a href="#org9e39afd">Keywords</a></li>
<li><a href="#org68b776d">Questions</a></li>
<li><a href="#org7c66034">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9e4de33" class="outline-2">
<h2 id="org9e4de33">Navigation</h2>
<div class="outline-text-2" id="text-org9e4de33">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">User's Guide for Oracle Business Intelligence Enterprise Edition</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 1: Introducing Oracle Business Intelligence</td>
<td class="org-left">&vert; <a href="../001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.html">html</a> &vert; <a href="./001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org802ff95" class="outline-2">
<h2 id="org802ff95">Notes</h2>
<div class="outline-text-2" id="text-org802ff95">
</div>
<div id="outline-container-orga59f1cf" class="outline-3">
<h3 id="orga59f1cf">Section 1.1: Preface</h3>
<div class="outline-text-3" id="text-orga59f1cf">
<ul class="org-ul">
<li>The Oracle Business Intelligence Foundation Suite is a complete, open, and integrated solution for all enterprise business intelligence needs including reporting, ad-hoc queries, OLAP (Online Analytical Processing), dashbords, scorecards, and what-if analysis</li>
<li>Oracle Business Intelligence Foundation Suite includes Oracle Business Intelligence Enterprise Edition</li>
<li>Oracle Business Intelligence Enterprise Edition (OBIEE) is a comprehensive set of enterprise business intelligence tools and infrastructure, including a scalable and efficient query and analysis server, an ad-hoc query and analysis tool, interactive dashboards, proactive intelligence and alerts, and an enterprise reporting engine</li>
<li><a href="https://docs.oracle.com/middleware/bi12214/bisuite/index.html">Oracle Docs Home for Oracle Business Intelligence Suite 12.2.1.4.0</a></li>
</ul>
</div>
</div>

<div id="outline-container-org75f3181" class="outline-3">
<h3 id="org75f3181">Section 1.2: New Features for Oracle Business Intelligence Users</h3>
<div class="outline-text-3" id="text-org75f3181">
<ul class="org-ul">
<li>Enhacements to graphs</li>
<li>Enhacements to views</li>
<li>Enhacement to analyses</li>
<li>Enhacement to scorecards</li>
<li>Enhacement to dashboards</li>
<li>New home page</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9e39afd" class="outline-2">
<h2 id="org9e39afd">Keywords</h2>
<div class="outline-text-2" id="text-org9e39afd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">OBIEE</td>
<td class="org-left">Oracle Business Intelligence Enterprise Edition (a complete, open, and integrated solution for all enterprise business intelligence needs)</td>
</tr>

<tr>
<td class="org-left">Ad-hoc Queries</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OLAP</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org68b776d" class="outline-2">
<h2 id="org68b776d">Questions</h2>
<div class="outline-text-2" id="text-org68b776d">
<ul class="org-ul">
<li><b>Q</b>: What are ad hoc queries?
<ul class="org-ul">
<li><a href="https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query">StackOverFlow Answer</a></li>
<li><a href="https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query">ThoughtSpot Ad-hoc Article</a></li>
<li>Ad-hoc queries are queries that are created for specific purposes to gather information that is needed right now thus the query is loosely created or created on the fly because we need some information right now from the data</li>
<li>How is this important for OBIEE? Well if a Oracle customer has a bunch of data, let's say data about their customers, then they can create ad-hoc queries to find out: what is the common age group? where do they live? what do they buy?</li>
<li>Questions can be quickly answered from the data, basically filtering and answering questions by these ad-hoc queries</li>
<li>Plus these ad-hoc queries are questions that need to be answered now thus these queries might not be run again later or may change in the answer if it is run later</li>
<li>These seems like regular queries to me, so why the name? The difference is ad-hoc queries are used "on the fly" by data analysts that are exploring answers and researching and filtering the data. These queries tend to be short and quickly created. Compare this to stored procedures, these queries are typically longer and follow some chronological order but this is because we are not trying to answer a new question now but rather see if the answer of a previous question has changed</li>
<li>Thus stored procedures are different than ad-hoc queries because stored procedures are running the same query throughout different times</li>
</ul></li>

<li><b>Q</b>: What is OLAP (Online Analytical Processing)?</li>
</ul>
</div>
</div>

<div id="outline-container-org7c66034" class="outline-2">
<h2 id="org7c66034">Summary</h2>
</div>
</div>
</body>
</html>
